<?php

$changbanpo = [
    'welcomeToScript' => '欢迎来到情景游戏 {title}.',

    'continuePlay' => '接下来将继续您之前的游戏进度. ',

    'description' => '本游戏是情景互动游戏, 分为若干章节, 做出正确的选择可以抵达最终好结局. 有时前面章节的决定, 会影响后面章节的结果, 您可以通过说"选择章节"回到前面做出正确选择. 在游戏过程中, 您可以尝试说出以下指令: {suggestionStr}. ',

    'startEpisode' => '开始 {option}, {title};',

    'quitGame' => '游戏退出, 进度已保存.',

    'showUnlockEndings' => '您已解锁的结局有: {titles}.',

    'menu' => '请您选择以下的 "菜单"功能: {suggestionStr}.',

    'chooseEpisode' => '您可以说出章节名称选择要开始的章节. 已解锁章节有: {suggestionStr}.',

    'searchGan' => '第一章, 寻找甘夫人.',

    'playZhao' => '您现在扮演的是赵云将军.',

    'background' => '曹操南征荆州, 主公刘备领荆州十数万平民前往江陵, 您奉命保卫刘将军的家眷, 甘夫人, 糜夫人和尚在襁褓之中的少主阿斗.',

    'fightWholeNight' => '不料我军 在长坂城一带被曹操精锐部队追上, 我军大败. 您从半夜和曹军厮杀,  一直战斗到天亮. 既找不到主公刘备, 又和两位夫人在乱军中失散. ',

    'ifGoFindGan' => '现在, 您想去寻找二位夫人的下落, 又担心刘将军自身的安危. 请决定是否寻找二位夫人? ',


    'endDieRegrat' => '您认为还是刘备性命要紧, 血战杀出重围, 在长板桥后二十里的大树下, 找到了众人保护下的刘备将军. 然而甘夫人, 糜夫人和阿斗都命丧乱军之中. 之后许多年, 刘将军对待您一如既往, 从未提起过您的失职. 不过内心的悔恨始终盘旋在您心头, 最终在一场大病中含恨离开了人世. ',

    'unlockEnding' => '获得结局, "{ending}". ',

    'noUnlockEndings' => '还没有获得任何结局. ',

    'endEpisode' => '本章结束. ',

    'badEnding' => '似乎结局不够完美, 您想再试一次吗?',

    'startSearchGan' => '您心中想道: 主公将甘夫人, 糜夫人和少主阿斗托付给我, 今日军中失散, 有何面目再去见刘将军? 不如决一死战, 豁出性命, 也要找到二位夫人与阿斗的下落. ',

    'meetCivilians' => '您于是率领三十位骑士杀回了战场. 周围到处都是逃亡中的荆州百姓, 嚎哭声震天动地. 前面草坡上就有几个被遗弃的重伤员在呻吟着. 不过战情紧迫, 似乎也没时间顾及他们.',

    'shouldHelpCivilians' => '您是否想看一眼这些重伤者?',

    'missJianYong' => '时间如此紧迫, 到处都是伤患, 哪能顾得了每一个人? 您赶紧率队往战场长坂坡前进. ',

    'meetSoldier' => '人马走到一处, 突然一人大叫: "赵将军哪里去?" 您转头一看, 原来是名护送刘备家人车杖的士兵, 中箭倒在墙角, 血流满地. ',

    'toldAboutGan' => '您赶忙去问二位夫人的消息. 中箭士兵说道: "刚才看到甘夫人披着头发, 鞋子也掉了, 跟随一群百姓妇女, 往南边逃走了. 赵将军快去找她们吧". ',

    'meetThreeCrowds' => '您赶紧率队往南追去, 果然在前方看到三个方向都有人群. 一群是男女百姓在逃命, 一群是我方的败兵在流窜, 而不远处看得到夫人亲卫队战士在与追兵交战.',

    'searchWhichCrowd' => '您决定要去哪一边寻找甘夫人, 是百姓, 残兵, 还是战士呢?',

    'searchRunners' => '您冲到逃跑的残兵中间, 喝止住了溃逃. 简短地整编了队伍, 多了将近一百名战力. 您率领他们重新杀回长坂坡战场.',

    'notFoundGan' => '追兵越来越多, 血战了半日, 您再也没有找到甘夫人和糜夫人的消息. 身边的战士一个个阵亡, 您也精疲力竭. 最终倒在了长坂坡敌军的枪林之中, 用生命履行了自己的誓言. ',

    'meetJianYong' => '您虽然心中知道无法救助所有人, 但也多看了这些伤员几眼. 没想到您看见其中一人, 正是主公的心腹谋士简雍. 您急忙问他二位夫人的下落. 简雍说: "两位夫人丢下了车杖, 抱着阿斗徒步往那边逃走. 我策马追过去, 不料被一名敌将刺了一枪, 夺走了我的战马, 眼看倒在这里等死." ',

    'shouldHelpJianYong' => '您扶起简雍, 决定将他送离战场. 然而一方面简雍伤势不轻; 另一方面局势紧迫, 人力和马匹都很紧缺. 该怎么办呢? 请选择 {suggestionStr}.',

    'helpNotice' => '没有明白您的意思. 您可以说 {suggestionStr}.',

    'sendSoldierWithJian' => '您在随从中借了一匹马, 又命令二人护送简雍南走. 要简雍为您带去口信, "我赵云上天入地, 好歹要找到二位夫人与少主, 若找不到, 战死沙场而已!" ',

    'giveJianHorse' => '您在随从中借了一匹马给简雍, 要简雍为您带去口信, "我赵云上天入地, 好歹要找到二位夫人与少主, 若找不到, 战死沙场而已!"',

    'takeCareJian' => '您担心简雍负伤, 周围就是战场, 遇到追兵或流寇他也走不远. 于是决定亲自护送一程. 眼看简雍逃出战场之后, 您赶紧率队伍赶回了战场. ',

    'meetDiedSoldier' => '这时敌军已经杀了过来, 您一边拼杀, 一边寻找. 遇到了一位护送刘备家人车杖的士兵, 赶紧抱起来追问, 可他奄奄一息, 还没说出话来就已经断气了. ',

    'searchFighters' => '您带队冲向了战士们, 帮他们杀退了追兵. 人马加在一起又多了几十人. 可他们光顾作战, 已经无从得知两位夫人的下落了. ',

    'foundGan' => '您顾不得战事, 赶紧追上百姓, 大叫"甘夫人在吗?". 只听得人群中一人放声大哭, 正是甘夫人. 您下马, 插枪, 流着泪说:"让夫人失散, 是我赵云的罪过! 糜夫人与少主在吗?". ',

    'toldMi' => '甘夫人抹掉眼泪说, "我与糜夫人被曹军追赶上, 丢下了车杖, 和百姓一起步行逃走, 又被一伙敌兵冲散, 糜夫人与阿斗不知去了哪里, 我独自逃生到此." 正说话间, 杀声震天, 远处一伙敌兵冲了过来. 欲知后事如何, 请听下回分解. ',

    'unlockEpisode' => '解锁新章节: {episode}.',

    'askStartNewEpisode' => '请问要开始新章节吗?',

    'choiceNotExists' => '没能明白您的意思. 可说"菜单"打开其它功能.',

    'needConfirmation' => '没能明白您的意思. 可以试着说"是的", 或者"不要".',

    'confirmPlay' => '是否开始: {episode}?',

    'meetChun' => '正和甘夫人说话间, 杀过来了一枝数百人的敌军, 由曹仁部将淳于导率领. 淳于导手持大刀, 马上还绑着一员我方将领, 看来正要去邀功请赏. ',

    'shouldFightChun' => '您正想去迎战, 又转念一想甘夫人还在身边, 万一陷入缠斗, 则甘夫人性命难保. 是否去迎战呢?',

    'saveMiZhu' => '您大喝一声, 挺枪纵马, 直取淳于导. 淳于导完全不是对手, 几回合后被您一枪刺倒马下, 他的队伍赶紧撤退了. 您抢下两匹马, 救下淳于导俘虏的将领, 原来正是糜夫人的哥哥糜竺.',

    'fightToChangBan' => '您请甘夫人和糜竺上马, 当先杀开一条大路, 直到长坂城下. 正看见张飞将军横着蛇矛立在桥上.',

    'ifOnlySendMessage' => '您非常高兴, 策马去与张将军搭话. 不料张飞大吼一声, "赵子龙!你为何背叛我哥哥?" 同时一枪刺来. 你猝不及防, 胸口中枪倒在地上, 心中最后闪过的念头是: 肯定有逃兵造谣说我背叛刘将军了, 如果之前, 找到谁, 帮我, 送信, 就好了...',

    'talkWithZhang' => '不料张飞大吼一声, "赵子龙!你为何背叛我哥哥?" 您连忙解释: "我找不到两位夫人和少主, 所以才落后, 是谁诬陷我背叛?" 张飞将军说 : "的确有人说你投奔曹操了. 若不是简雍先过来报信, 我肯定误会你了."',

    'miZhuSendGan' => '您把误会解释清楚, 问清主公刘备所在. 张将军要防守长板桥, 您便让糜竺率队护送甘夫人离去, 转身又杀回了长坂坡战场. ',

    'zhangFeiSendGan' => '您把误会解释清楚, 问清主公刘备所在. 手头没人, 只好请张将军暂离长板桥, 护送甘夫人离去. 您转身又杀回了长坂坡战场.',

    'meetXiaHouEn' => '正走之间, 您看到前方一名曹军将领, 带着十几个骑兵, 正在抢劫逃难的百姓.',

    'shouldLeaveXiaHouEn' => '然而时间紧迫, 如果和该将领缠斗, 来不及救糜夫人怎么办? 您决定是否要悄悄离开呢?',

    'leaveXiaHouEn' => '还是救糜夫人和少主阿斗要紧. 您咬了咬牙, 策马从这帮劫匪背后绕了过去.',

    'killXiaHouEn' => '您决定要惩戒这些劫匪, 也不和他们搭话, 对着敌将冲过去. 只一回合, 就把他刺倒马下, 其他人都逃跑了. 您定睛一看, 这名曹将背后背着一口剑, 剑鞘上嵌着"青釭"两字. 原来这是替曹操背剑的小将夏侯恩. 您拾起了宝剑, 背在自己背上. ',

    'toldAboutMi' => '您重新杀回战场, 回顾周围, 已经没有一人跟从了. 而您只顾寻觅糜夫人踪迹, 逢人便问. 终于有一名百姓说道: "糜夫人左腿中了枪, 走不了路, 抱着小孩倒在前面那个小村子里了."  欲知后事如何, 且听下回分解.',

    'ladyMi' => '第三章, 舍身托孤.',

    'playLadyMi' => '这一章您扮演的是糜夫人. ',

    'hideCorner' => '自从被敌军冲散后, 您抱着阿斗逃跑, 腿上又中了一枪, 行走不动, 只好留在这个小村落, 找到一面被火烧塔的断墙, 靠着枯井躲了起来. ',

    'armyIsNear' => '周围打斗的声音又起. 您紧抱着阿斗, 不知如何是好. ',

    'shouldControlDou' => '阿斗眼看被喊杀声吓哭, 势必招来敌军. 在这紧要关头, 是否要捂住阿斗不让他哭出声音呢? ',

    'endNotBeFound' => '您捂住了阿斗, 没有被周围的敌人发现. 可时间流逝, 始终没有刘备将军的人马找到自己. 最终曹操大军到来, 您为自己和阿斗不受辱, 抱着阿斗跳入了旁边的枯井中.',

    'foundByZhao' => '您心想事已至此, 捂住阿斗一时不哭又有何用? 反而伤心的抱着阿斗一起哭起来. 果然有人寻声而来, 拨开断墙, 进来的竟然是赵云将军! 真是绝处逢生! ',

    'thankZhao' => '赵将军下马便行礼, 您对赵将军说: "能见得将军, 阿斗有救了! 求将军您可怜阿斗父亲半世漂泊, 这有这一个孩子. 您可保护阿斗, 让他能重见父亲!" ',

    'askRideHorse1' => '赵将军说: "夫人受难, 是我的罪过! 现在不必多说, 请夫人上马, 我步行死战, 一定保护夫人突出重围!" 请决定要上马吗? ',

    'endDieHalfWay' => '您听从赵将军, 抱着阿斗上马. 曹操大军也很快杀到, 赵云将军手持长枪宝剑, 以一敌百, 英勇无比. 可您被弓箭射下马来, 赵将军一时慌乱, 也被曹军刺倒在地. 哎...天命难违. ',

    'rideHorse2' => '您大声拒绝: "不可！将军怎能无马！这孩子全靠将军保护。我已重伤，死何足惜！求将军快抱着孩子离去，不要被我拖累!"',

    'askRideHorse2' => ' 可赵云还是催道: "喊声越来越近, 追兵就要到了, 夫人您快上马啊!" 请决定要上马吗? ',

    'giveDou' => '您向赵云说道: "我肯定走不了了, 千万别两边都耽搁了!" 边说边把阿斗塞到赵云将军怀里, 说 "这个孩子的性命都靠将军了!"',

    'enemyIsNear' =>  '赵云仍不放弃, 三番两次劝您上马. 可四周的喊杀声已经非常近了. ',

    'rideHorse3' => '赵云厉声大喊道: "夫人不听我的话, 敌军马上就到了, 这可怎么办啊!". ',

    'rideOrRun' => '您必须得做出最后的决定了, 是骑马, 步行, 还是...还是... 还是枯井呢?',

    'endDieRunning' => '多说无益, 您抱着阿斗, 拖着伤腿转身就走. 赵云只好翻身上马, 一把将您和阿斗提到马上. 但追兵已经杀到身边, 您俯身马上, 赵将军神勇无比, 一以敌百, 但马驮着两人跑不快, 最终箭如雨下, 都被射倒在地. 您倒在地上, 仍然死死地把阿斗抱在怀中...您的意识逐渐消失, 脑海中只剩下一个念头, "为何听不到斗儿的哭声了, 不知他是否无恙..." ',

    'miJumpWell' => '多说无益, 糜夫人将阿斗往地上一放, 转身毅然跳入枯井而死. ',

    'MiPoetry' => '后人有诗赞叹糜夫人: "战将全凭马力多，步行怎把幼君扶？拚将一死存刘嗣，勇决还亏女丈夫". 欲知后事如何, 且听下回分解.',

    'coverMi' => '糜夫人已投井, 您将土墙推倒, 掩盖枯井.',

    'carryDou' => '解下护心镜, 将阿斗绑在怀中, 提枪上马. ',

    'faceZhangHe' => '早有一支敌军杀到, 当先一员大将, 旗号分明, 写着"河间张郃" 四个大字. 您也不跟他废话, 挺枪便刺. 交手了十几个回合, 胜负难分. ',

    'shouldFightHe' => '看来对手不弱, 一时无法取胜. 还要继续跟他斗吗? ',

    'endTooManyEnemy' => '您坚持着战斗, 非常英勇. 但体力越来越弱, 而敌军却有增无减, 把您团团围住. 突然, 您感到后心一凉, 眼前发黑, 从马上茫然坠落... 怀中阿斗的哭声, 也听不见了... ',

    'runawayHe' => '棋逢对手, 您不敢恋战, 虚晃一枪, 夺路而逃. 而张郃拍马在后紧紧追赶, 眼前却是一片土坑, 路太难走, 该怎么办? ',

    'shouldFightAgain' => '是否要转身再与张郃战斗呢? ',

    'jumpOutTrap' => '您咬紧牙关, 策马加鞭往前跑去. 不想趷跶一声，连马和人, 都摔到了土坑里面.张郃挺枪来刺, 忽然一道红光, 从土坑中滚起, 那匹马平空一跃, 跳出坑外. 张郃大惊失色, 不再敢追. ',

    'jumpPoetry' => '后人有诗赞叹说: "红光罩体困龙飞, 征马冲开长坂围. 四十二年真命主, 将军因得显神威."',

    'fourGenerals' => '才出龙潭, 又入虎穴. 前面马延, 张凯, 焦触, 张南四名河北将军, 又把您团团围住. ',

    'shouldFightFourGenerals' => '是否与他们决一死战呢?',

    'endCaught' => '您继续逃走, 但四面八方都是曹军, 真是插翅难飞. 忽然马一个踉跄, 被曹军士兵用绳索套倒, 您被压在马下, 动弹不得, 眼看周围士兵挺着密密麻麻的枪林围拢过来....',

    'fightFourGenerals' => '事已至此, 再无退路. 您一人舞枪, 力战四将, 周围曹兵蜂拥而至. ',

    'useQingGang' => '您拔出青釭宝剑乱砍, 原来这宝剑削铁如泥, 砍到盔甲上就像切开一张纸一般. 一时杀得没人再敢近前, 直接冲出重围.',

    'caoHongAskName' => '旁边景山上一名武将策马飞驰而来, 却不交战, 只是大喊 "战将! 且留下姓名!" ',

    'notTellNameToHong' => '您也不理会他, 一心想杀出重围.',

    'endDieArrows' => '突然景山之上, 万箭齐发, 您勉强拨开几支箭羽, 还是被数十根厉箭穿身, 一头栽倒在地.',

    'tellNameToHong' => '您大声应道: "我乃常山赵子龙是也!" 那名武将听到后策马回到景山上了. 说来也奇怪, 这一场战斗却无人放冷箭, 您得以血战逃脱. ',

    'faceWenPing' => '您杀出重围, 已脱离了大战场, 血满征袍. 眼看要到长板桥, 却又看到一枝曹军已经包抄到此, 原来是荆州降将文聘.',

    'shouldFightPin' => '您自觉已经人困马乏, 还要与他交战吗?',

    'goToBridge' => '您无心再战, 策马冲上长板桥头. ',

    'feiNotAtBridge' => '然而张飞将军护送甘夫人未归, 您转眼又被追兵围上.',

    'feiHoldBridge' => '张飞将军果然横矛立马在桥上, 您大声喊道: "翼德帮我!", 张飞从容说道:"子龙快去, 我来挡住追兵!" ',

    'findBei' => '您纵马过桥, 又骑了几里, 眼看见主公刘备正和众人在一棵大树下休息. 您突然意识到好久没听见阿斗哭泣了, 赶紧低头看怀中, 原来阿斗正酣睡未醒. 一股悲喜涌上您心头. ',

    'yunPoetry' => '这一场大战, 赵云砍倒大旗两面, 夺槊三条, 击败曹营名将五十余人, 保护刘备独子阿斗无恙. 后人有诗赞叹: "血染征袍透甲红, 当阳谁敢与争锋! 古来冲阵扶危主, 只有常山赵子龙!',

    'shouldTellName' => '是否要告诉他名字呢?',

    'goodEnding' => '恭喜您获得了好结局. 游戏结束.',


];

$data = [];
$data['storyComponent']['sanguo']['changbanpo'] = $changbanpo;

return $data;
